{"name":"Scientific Writing & Presentation in Computer Science","date":"2024-06-07","timeStart":"13:00","description":"Join Our Workshop: Scientific Writing & Presentation in Computer Science!\n\n\nKommt in unseren Workshop: Wissenschaftliches Schreiben & Präsentieren in Informatik!\n\n\nAre you a Bachelor's or Master's student currently writing your thesis or planning to start? Elevate your work and connect with peers at our Scientific Writing & Presentation in Computer Science event! German and English-speakers welcome!\n\n\nKick-Off Date: Friday 06/07/2024 \n\n\nTime: 13:00 o'clock\n\n\nLocation: ITC 2+ 0.16 GI-ROOM\n\n\nWhy Attend?\n\n\n\nCollaborate & Exchange Ideas: \n\nEngage with fellow students facing similar challenges and share innovative solutions. \n\nExpert Guidance: \n\nReceive invaluable advice from experienced alumni who have successfully navigated the path you're on. \n\nEnhance Your Skills: \n\nImprove your scientific writing and presentation abilities, making your work stand out.\n\nPeer Support:\n\nBuild a supportive community to brainstorm and refine your ideas. \n\nProfessional Feedback: \n\nGet personalized tips and feedback from alumni who understand the nuances of computer science research. \n\nSkill Development: \n\nLearn best practices for writing and presenting your research effectively.\n\n\nWho Should Attend?\n\n\n\nBachelor's and Master's students in Computer Science those currently working on their thesis or about to begin. People who seek for guidance and workshops regarding their scientific paper.\n\n\nWho are we?\n\n\n\nGesellschaft für Informatik\n\nWe are an association for those interested in computer science. We inspire and connect students from and beyond the computer science department. The membership is free for students. To become a member please follow this link: https://gi.de/mitgliedschaft \n\n*unfortunately there is no translation to english for this site yet, but we are working on it.\n\n\nDon't miss this opportunity to boost your thesis and network with like-minded individuals! RSVP Today and take the first step towards a successful thesis journey! \n\n\nFor more information, contact us at https://www.instagram.com/jgi_deggendorf/ or via mail deggendorf-leitung@junge.gi.de.\n\n\nLet's Write, Present, and Succeed Together!\n\n#ScientificWriting #ThesisHelp #ComputerScience #AcademicSuccess #AlumniSupport","imagePath":""}